Tekla.Structures.Model.RebarSpacing.OffsetEnum
The offset distance type.

Tekla.Structures.Model.RebarSpacing.OffsetEnum.EXACT
The offset distance is exact.

Tekla.Structures.Model.RebarSpacing.OffsetEnum.MINIMUM
The offset distance is the minimum required.